* 数据类型

** 整数 
   int8
   int16 
   int32
   int64
   int,uint
   rune=int32
   byte=unit8

** 浮点数
   float32
   float64
   #+begin_src go 
     package main
     import (
	     "fmt"
	     "math"
     )
     func main(){
     fmt.Println(math.MaxFloat64)
     }

   #+end_src

   #+RESULTS:
   : 1.7976931348623157e+308

** 复数
   complex64
   complex128
   #+begin_src go :imports "fmt"
   var x complex128 = complex(1,2)
   fmt.Println(x)
   #+end_src

   #+RESULTS:
   : (1+2i)

** 布尔值

** 字符串
   不可变的字节序列，可以包含任意数据

** 常量
   编绎时计算完成

*** 常量生成器iota
    #+begin_src go :imports "fmt"
      const (
	      kb =1024 << iota*2.5
	      mb
	      gb
	      yb
      )
      fmt.Println(mb,gb,yb)
    #+end_src

    #+RESULTS:
    : 5120 10240 20480

